#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      jeng
#
# Created:     12/11/2014
# Copyright:   (c) jeng 2014
# Licence:     <your licence>
#-------------------------------------------------------------------------------

from PIL import Image
from numpy import *


def 取灰階圖特徵值(來源):
    彩圖 = Image.open(來源)
    灰階圖 = 彩圖.convert("L")

    #print(灰階圖)

    圖矩陣 = asarray(灰階圖)

    #print(圖矩陣)
    特徵值,特徵矩陣 = linalg.eigh(圖矩陣)  #取特徵值和特徵向量
    特徵值 = 特徵值/100000    #貓臉特徵值有破千的值出現，為了讓輸入值為0~1所以作縮小 (1/8發現若除更大，使值更小 在訓練時會以緩慢的速度持續減少誤差，但還未知會收斂至何處 )
    #print(特徵值)

    return(特徵值)


def main():


    取灰階圖特徵值("D:/類神經網路/貓/訓練/頭/波斯1.jpg")
    取灰階圖特徵值("D:/類神經網路/貓/訓練/頭/波斯2.jpg")

    print(" ")
    print("------------以上波斯貓----------以下折耳")
    print(" ")

    取灰階圖特徵值("D:/類神經網路/貓/訓練/頭/摺耳1.jpg")
    取灰階圖特徵值("D:/類神經網路/貓/訓練/頭/摺耳2.jpg")


if __name__ == '__main__':
    main()




